select case when t.work_tel in('15386324976',
'19173206784',
'18317269157',
'15202562923',
'15573160130',
'13584311357',
'15729128954')  then t.work_tel
when t1.r_tel in('15386324976',
'19173206784',
'18317269157',
'15202562923',
'15573160130',
'13584311357',
'15729128954') then t1.r_tel end 手机号,
count(1) 总下单量,sum(case when t1.flag_id in(8,9,10) then 1 else 0 end) 取消量
from cqsale.cq_order@to_air t
  join cqsale.cq_order_head@to_air t1 on t1.flights_order_id=t.flights_Order_Id
 where t.order_date>=date'2022-04-01'
 and t1.r_flights_date>=date'2022-04-01'
 --and t1.flag_id in(8,9,10)
 and t1.whole_flight like '9C%'
 and (t.work_tel in('15386324976',
'19173206784',
'18317269157',
'15202562923',
'15573160130',
'13584311357',
'15729128954') or t1.r_tel in('15386324976',
'19173206784',
'18317269157',
'15202562923',
'15573160130',
'13584311357',
'15729128954'))
group by case when t.work_tel in('15386324976',
'19173206784',
'18317269157',
'15202562923',
'15573160130',
'13584311357',
'15729128954')  then t.work_tel
when t1.r_tel in('15386324976',
'19173206784',
'18317269157',
'15202562923',
'15573160130',
'13584311357',
'15729128954') then t1.r_tel end;

-------------下单IP

select t.remote_ip,
count(1) 总下单量,sum(case when t1.flag_id in(8,9,10) then 1 else 0 end) 取消量
from cqsale.cq_order@to_air t
  join cqsale.cq_order_head@to_air t1 on t1.flights_order_id=t.flights_Order_Id
 where t.order_date>=date'2022-04-01'
 and t1.r_flights_date>=date'2022-04-01'
 --and t1.flag_id in(8,9,10)
 and t1.whole_flight like '9C%'
 and t.remote_ip in('220.189.78.239',
'27.150.94.215',
'122.232.194.207',
'183.150.159.71',
'119.112.91.56',
'223.243.21.153',
'223.243.21.153',
'124.232.153.85',
'124.232.153.85',
'49.69.61.212',
'117.86.126.156',
'113.237.231.98',
'114.102.61.129',
'223.198.250.17',
'223.198.250.17',
'182.54.97.40',
'113.120.35.68',
'116.208.94.127',
'121.232.33.84',
'222.242.189.107',
'27.159.184.142',
'1.199.40.180',
'114.239.199.138')
group by t.remote_ip;

------------------下单client_id

select t.client_id,
count(1) 总下单量,sum(case when t1.flag_id in(8,9,10) then 1 else 0 end) 取消量
from cqsale.cq_order@to_air t
  join cqsale.cq_order_head@to_air t1 on t1.flights_order_id=t.flights_Order_Id
 where t.order_date>=date'2022-04-01'
 and t1.r_flights_date>=date'2022-04-01'
 --and t1.flag_id in(8,9,10)
 and t1.whole_flight like '9C%'
 and t.client_id in(216369909,
216368816,
216493379,
216515038,
216340213,
200425704,
200425704,
218858273,
218858273,
216339467,
197829024,
212807049,
198385427,
197016270,
197016270,
196685590,
216369953,
215721186,
200940399,
216528692,
216341876,
216529292,
216473422)
group by t.client_id;

-----下单联系方式统计


select case when t.work_tel in('17027511093',
'16264022067',
'17016184287',
'17026712951',
'17027518104',
'17059177943',
'17059177943',
'18528210377',
'18528210377',
'17022870510',
'17037953242',
'17020451141',
'17073117089',
'16566839198',
'16566839198',
'16530718979',
'17027514805',
'16234078439',
'17030468025',
'17026719581',
'16260469155',
'17019480016',
'16271090467')  then t.work_tel
when t1.r_tel in('17027511093',
'16264022067',
'17016184287',
'17026712951',
'17027518104',
'17059177943',
'17059177943',
'18528210377',
'18528210377',
'17022870510',
'17037953242',
'17020451141',
'17073117089',
'16566839198',
'16566839198',
'16530718979',
'17027514805',
'16234078439',
'17030468025',
'17026719581',
'16260469155',
'17019480016',
'16271090467') then t1.r_tel end 手机号,
count(1) 总下单量,sum(case when t1.flag_id in(8,9,10) then 1 else 0 end) 取消量
from cqsale.cq_order@to_air t
  join cqsale.cq_order_head@to_air t1 on t1.flights_order_id=t.flights_Order_Id
 where t.order_date>=date'2022-04-01'
 and t1.r_flights_date>=date'2022-04-01'
 --and t1.flag_id in(8,9,10)
 and t1.whole_flight like '9C%'
 and (t.work_tel in('17027511093',
'16264022067',
'17016184287',
'17026712951',
'17027518104',
'17059177943',
'17059177943',
'18528210377',
'18528210377',
'17022870510',
'17037953242',
'17020451141',
'17073117089',
'16566839198',
'16566839198',
'16530718979',
'17027514805',
'16234078439',
'17030468025',
'17026719581',
'16260469155',
'17019480016',
'16271090467') or t1.r_tel in('17027511093',
'16264022067',
'17016184287',
'17026712951',
'17027518104',
'17059177943',
'17059177943',
'18528210377',
'18528210377',
'17022870510',
'17037953242',
'17020451141',
'17073117089',
'16566839198',
'16566839198',
'16530718979',
'17027514805',
'16234078439',
'17030468025',
'17026719581',
'16260469155',
'17019480016',
'16271090467'))
group by case when t.work_tel in('17027511093',
'16264022067',
'17016184287',
'17026712951',
'17027518104',
'17059177943',
'17059177943',
'18528210377',
'18528210377',
'17022870510',
'17037953242',
'17020451141',
'17073117089',
'16566839198',
'16566839198',
'16530718979',
'17027514805',
'16234078439',
'17030468025',
'17026719581',
'16260469155',
'17019480016',
'16271090467')  then t.work_tel
when t1.r_tel in('17027511093',
'16264022067',
'17016184287',
'17026712951',
'17027518104',
'17059177943',
'17059177943',
'18528210377',
'18528210377',
'17022870510',
'17037953242',
'17020451141',
'17073117089',
'16566839198',
'16566839198',
'16530718979',
'17027514805',
'16234078439',
'17030468025',
'17026719581',
'16260469155',
'17019480016',
'16271090467') then t1.r_tel end;


----下单邮箱

select t.email 手机号,
count(1) 总下单量,sum(case when t1.flag_id in(8,9,10) then 1 else 0 end) 取消量
from cqsale.cq_order@to_air t
  join cqsale.cq_order_head@to_air t1 on t1.flights_order_id=t.flights_Order_Id
 where t.order_date>=date'2022-04-01'
 and t1.r_flights_date>=date'2022-04-01'
 --and t1.flag_id in(8,9,10)
 and t1.whole_flight like '9C%'
 and t.email ='1174533451@qq.com'
group by t.email;


----注册IP对应的注册账号量

select t1.register_ip,count(1)
 from cust.cq_flights_users@to_air t1
 where t1.register_ip in('182.136.98.103',
'113.235.72.18',
'114.103.80.199',
'115.49.192.163',
'183.32.223.114',
'183.185.155.165',
'183.185.155.165',
'220.202.232.2',
'220.202.232.2',
'42.7.30.192',
'27.42.185.96',
'106.110.131.105',
'221.211.204.20',
'121.27.45.122',
'121.27.45.122',
'120.6.203.193',
'221.203.151.151',
'125.112.48.43',
'183.150.167.180',
'119.113.204.189',
'180.125.96.113',
'111.227.69.81',
'124.161.215.245')
group by t1.register_ip;


---注册IP关联到下单IP的数据


select t.remote_ip,
count(1) 总下单量,sum(case when t1.flag_id in(8,9,10) then 1 else 0 end) 取消量
from cqsale.cq_order@to_air t
  join cqsale.cq_order_head@to_air t1 on t1.flights_order_id=t.flights_Order_Id
 where t.order_date>=date'2022-04-01'
 and t1.r_flights_date>=date'2022-04-01'
 --and t1.flag_id in(8,9,10)
 and t1.whole_flight like '9C%'
 and t.remote_ip in('182.136.98.103',
'113.235.72.18',
'114.103.80.199',
'115.49.192.163',
'183.32.223.114',
'183.185.155.165',
'183.185.155.165',
'220.202.232.2',
'220.202.232.2',
'42.7.30.192',
'27.42.185.96',
'106.110.131.105',
'221.211.204.20',
'121.27.45.122',
'121.27.45.122',
'120.6.203.193',
'221.203.151.151',
'125.112.48.43',
'183.150.167.180',
'119.113.204.189',
'180.125.96.113',
'111.227.69.81',
'124.161.215.245')
group by t.remote_ip;


----代理联系方式对应机票量


select case when t.work_tel in('18874720132','15055461077')  then t.work_tel
when t1.r_tel in('18874720132','15055461077') then t1.r_tel end 手机号,
count(1) 总下单量,sum(case when t1.flag_id in(8,9,10) then 1 else 0 end) 取消量
from cqsale.cq_order@to_air t
  join cqsale.cq_order_head@to_air t1 on t1.flights_order_id=t.flights_Order_Id
 where t.order_date>=date'2022-04-01'
 and t1.r_flights_date>=date'2022-04-01'
 --and t1.flag_id in(8,9,10)
 and t1.whole_flight like '9C%'
 and (t.work_tel in('18874720132','15055461077') or t1.r_tel in('18874720132','15055461077'))
group by case when t.work_tel in('18874720132','15055461077')  then t.work_tel
when t1.r_tel in('18874720132','15055461077') then t1.r_tel end;